/*
Each new term in the Fibonacci sequence is generated by adding the previous two terms. By starting with 1 and 2, the first 10 terms will be:

1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...

By considering the terms in the Fibonacci sequence whose values do not exceed four million, find the sum of the even-valued terms.
-------------------------------------------------------------------------------------------------------------------------------------------
Каждый следующий элемент ряда Фибоначчи получается при сложении двух предыдущих. Начиная с 1 и 2, первые 10 элементов будут:

1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...

Найдите сумму всех четных элементов ряда Фибоначчи, которые не превышают четыре миллиона.
*/
#include <pch.h>
#include <iostream>

using namespace std;

int main()
{
	int temp;
	int result = 0;
	int num1 = 1;
	int num2 = 2;
	for ( ; num2 < 4000000; ) {
		if (num2 % 2 == 0) {
			result += num2;
		}
		temp = num2;
		num2 = num1 + num2;
		num1 = temp;
	}
	cout << result;
	return 0;
}
